/*
1047 冒泡排序
时间限制:1000MS  代码长度限制:10KB
提交次数:8340 通过次数:3379

题型: 填空题   语言: GCC
Description
由键盘输入10个数，用“冒泡法”对10个数从小到大排序，并按格式要求输出。代码如下，请填充完整。




输入样例
70 5 14 20 19 2 99 67 13 66


输出样例
2 5 13 14 19 20 66 67 70 99
*/

/*
#include "stdio.h"
main()
{  int a[10], i, j, t;
   for(i=0;i<10;i++)
      scanf("%d",a+i) ;
   for(i=0;i<9;i++)
   {     for(j=0;j<9-i;j++)
         if (a[j]>a[j+1])
            {
            t=a[j];
            a[j]=a[j+1];
            a[j+1]=t;}

   }
   for(i=0;i<10;i++)
      printf("%d ",a[i]);
}
*/
