/*
18055 主对角线上的元素之和
时间限制:1000MS  代码长度限制:10KB
提交次数:0 通过次数:0

题型: 编程题   语言: G++;GCC
Description
输入一个3行4列的整数矩阵，计算并输出主对角线上的元素之和



输入格式
3行4列整数矩阵


输出格式
主对角线上的元素之和


输入样例
1 2 3 4
5 6 7 8
9 10 11 12


输出样例
18


提示
1，6和11
*/
/*
#include <stdio.h>

int main()
{
    int mal[3][4]={0};
    int i,j;

    for(i=0;i<3;i++)
    {
        for(j=0;j<4;j++)
        {
            scanf("%d",&mal[i][j]);
        }
    }
    printf("%d",mal[0][0]+mal[1][1]+mal[2][2]);

    return 0;
}
*/
