/*
14  求数列和
Time Limit:1000MS  Memory Limit:65535K
题型: 编程题   语言: G++;GCC
描述
有下列数列：

1/(2+3)  -(2+3)/(4+5) (4+5)/(6+7) -(6+7)/(8+9) (8+9)/(10+11) ....

请计算并输出该数列的前n项和，结果显示4位小数,4位之后的小数四舍五入。

注：请使用双精度浮点数，以确保所需的精度。

输入格式
一个正整数n（n<=100）
输出格式
数列前n项和
输入样例
3
输出样例
0.3368

*/

//int main()
//{
//    double sum=0,den=5,mol=1;
//    int i,n,sign=1;
//    scanf("%d",&n);
//
//    for(i=0;i<n;i++)
//    {
//        sum+=mol/den*sign;
//        sign*=-1;
//        mol=den;
//        den=mol+4;
//    }
//
//    printf("%.4lf",sum);
//
//
//
//    return  0;
//}

